export interface IQandA {
  question: string
  answer: string
}

export const frequentlyQuestions: IQandA[] = [
  {
    question: 'Openhouse มีอะไรให้ทำบ้าง ?',
    answer:
      'ตลอด 3 วันคณะวิศวกรรมศาสตร์ใน มจธ. จัดกิจกรรม Open house เปิดโอกาสให้น้อง ๆ ได้ร่วมเวิร์คช็อปในแต่ละภาค เพื่อสัมผัสประสบการณ์เรียนวิศวกรรมในแต่ละสภาพแวดล้อม ยังสามารถมีกิจกรรมพี่พาน้องทัวร์ไปเยี่ยมชมภาคต่าง ๆ น้อง ๆ สามารถร่วมกิจกรรม E-stamp เพื่อแลกของที่ระลึกสุดพิเศษได้อีกด้วย',
  },
  {
    question: 'กิจกรรม Workshop มีการลงทะเบียนหน้างานแบบ Walk-in หรือไม่ ?',
    answer: 'ลงทะเบียนหน้างานเเบบ Walk-in เท่านั้น',
  },
  {
    question: 'เดินทางมายังไง ?',
    answer: 'สามารถไปดูวิธีการเดินทางที่ "ช่องทางการเดินทาง" ได้เลยยย',
  },
  {
    question: 'เตรียมตัวยังไง เอาอะไรไปบ้าง ?',
    answer: 'โทรศัพท์มือถือที่ติดตัวได้ เพราะกิจกรรมของเราจะมีการเก็บ E-Stamp ผ่านเว็บไซต์ เพื่อแลกของที่ระลึกสุดพิเศษ',
  },
  {
    question: 'แต่งกายอย่างไรดี ?',
    answer:
      'ชุดนักเรียนหรือชุดสุภาพ (กางเกงขายาว รองเท้าหุ้มส้น) ไม่ควรใส่เสื้อแขนกุด เสื้อสายเดี่ยว เสื้อเอวลอย กางเกงขาสั้น หรือรองเท้าแตะ',
  },
  {
    question: 'ผู้ปกครอง หรือ คุณครูเข้าร่วมกิจกรรมได้หรือไม่ ?',
    answer: 'ผู้ปกครอง คุณครู หรือบุคคลภายนอกที่สนใจสามารถลงทะเบียนเพื่อเข้าร่วมกิจกรรมต่าง ๆ ได้',
  },
  {
    question: 'มีประกาศนียบัตรหรือไม่ ?',
    answer:
      'มีประกาศนียบัตรให้เเต่ต้องเป็นไปตามเงื่อนไขของกิจกรรม โดยเงื่อนไขการได้รับ คือมาลงทะเบียนเข้าร่วมที่จุดลงทะเบียนวันงาน นั่นเอง',
  },
  {
    question: 'กิจกรรมพี่พาน้องทัวร์ต่างจาก workshop อย่างไร',
    answer:
      'workshop คือกิจกรรมที่น้องได้ลงมือปฏิบัติแลบของแต่ละภาคซึ่งมาจากเนื้อหาที่ได้มีการสอนจริง แต่ปรับให้มีสนุกสนานมากขึ้น พี่พาน้องทัวร์ คือกิจกรรมที่พี่ ๆ พาน้องเยี่ยมชมแต่ละภาค เพื่อแนะนำให้น้อง ๆ นั้นรู้จักภาควิชาที่ได้ไปเยี่ยมชมมากขึ้น',
  },
]
