import Travel1 from '../images/about/Travel_1.jpg'
import Travel2 from '../images/about/Travel_2.jpg'
import Travel3 from '../images/about/Travel_3.jpg'

export interface ITravel {
  title: string
  image: string
  ways: ITravelWay[]
}

export interface ITravelWay {
  name?: string
  description?: string
  buses?: string[]
}

export const travels: ITravel[] = [
  {
    title: 'เครื่องบิน',
    image: Travel3,
    ways: [
      {
        name: 'สนามบินสุวรรณภูมิ',
        description:
          'นั่ง Airport Link ลง "สถานีพญาไท" ขึ้น BTS มาลง "สถานีวงเวียนใหญ่" ต่อรถโดยสารประจำทางสาย 120 หรือ 57 ลง "ดาวคะนอง" และต่อรถโดยสารประจำทางสาย 75 หรือ 21 ลงหน้ามหาลัย',
      },
      {
        name: 'สนามบินดอนเมือง',
        description: 'ขึ้นรถตู้ลง "อนุเสาวรีย์ชัย" ต่อรถโดยสารประจำทาง 140 ลง "กม.9" และต่อรถสองแถวลงหน้ามหาลัย',
      },
    ],
  },
  {
    title: 'รถโดยสารประจำทางที่ผ่านมหาวิทยาลัยฯ (ถนนประชาอุทิศ)',
    image: Travel2,
    ways: [
      {
        name: 'รถโดยสารที่ผ่านมหาวิทยาลัย',
        buses: [
          'สายรถ 75 เส้นทางเดินรถ วัดพุทธบูชา – หัวลำโพง',
          'สายรถ 21 เส้นทางเดินรถ วัดคู่สร้าง – จุฬาลงกรณ์มหาวิทยาลัย',
        ],
      },
      {
        name: 'รถโดยสารอื่นๆ (ต่อสาย)',
        buses: [
          'สายรถ 142 การเคหะ ชุมชนธนบุรี - อู่ฟาร์มจระเข้ (สมุทรปราการ)',
          'สายรถ 141 แสมดำ - จุฬาลงกรณ์มหาวิทยาลัย',
          'สายรถ 140 อนุเสาวรีย์ชัยฯ - แสมดำ',
          'สายรถ 138 พระประแดง - หมอชิตใหม่',
          'สายรถ 82 พระประแดง - สนามหลวง',
          'สายรถ 20 สุขสวัสดิ์ - ท่าดินแดง',
          'สายรถ 6 พระประแดง - เทเวศร์',
        ],
      },
    ],
  },
  {
    title: 'รถโดยสารขนาดเล็ก (กระป้อ)',
    image: Travel1,
    ways: [
      {
        buses: [
          'สายรถ 99 บางปะกอก - ทุ่งครุ',
          'สายรถ 90 ตลาดบางปะกอก - วัดทุ่งครุ',
          'สายรถ 88 บิ๊กซี (ราชบูรณะ)  - ทุ่งครุ',
          'สายรถ 77 บิ๊กซี (ราชบูรณะ) - วัดพุทธบูชา',
        ],
      },
    ],
  },
]
