export interface IEventSchedule {
  title: string
  date: Date | string
  time: string
  location?: string
  description?: string
}

export const eventSchedules: IEventSchedule[] = [
  {
    title: 'พิธีเปิดกิจกรรม Engineering Open house Canival at Bangmod',
    description:
      'ร่วมเป็นส่วนหนึ่งของพิธีเปิดกิจกรรม Engineering Open house Canival at Bangmod พร้อมแนวคิดดี ๆ จากประธานในพิธี ที่จะมาบอกเล่าถึงความเป็นมาของโครงการ และความเป็นวิศวะบางมด',
    location: 'บริเวณ ใต้อาคารเรียนรวม 4 (เวทีกลาง)',
    date: '10/14/2023',
    time: '08:30-9:00',
  },
  {
    title: 'กิจกรรมการแข่งขันนวัตกรรมฯ รอบชิงชนะเลิศ รอบเช้า',
    description:
      'มาฟังการนำเสนอโปรเจคต์ด้านนวัตกรรมและสิ่งประดิษฐ์จากน้อง ๆ ม.ปลาย พร้อมสาธิตผลงานให้ทุก ๆ คนได้ชมกันภายในงาน',
    location: 'บริเวณ ใต้อาคารเรียนรวม 4 (เวทีกลาง)',
    date: '10/14/2023',
    time: '12:00-16:00',
  },
  {
    title: 'ซุ้มขายของ',
    description: 'ซุ้มขายของ',
    location: 'บริเวณระหว่างอาคารเรียนรวม 5 และ ตึกวิศวกรรมเคมี',
    date: '10/14/2023',
    time: '09:00-17:00',
  },
  {
    title: 'กิจกรรมการแข่งขันนวัตกรรมฯ รอบชิงชนะเลิศ รอบบ่าย',
    location: 'บริเวณ ใต้อาคารเรียนรวม 4 (เวทีกลาง)',
    date: '10/14/2023',
    time: '13:00-15:30',
  },
  {
    title: 'Folk song (1)',
    location: 'บริเวณ ใต้อาคารเรียนรวม 4 (เวทีกลาง)',
    date: '10/15/2023',
    time: '10:00-11:30',
  },
  {
    title: 'ซุ้มขายของ',
    description: 'ซุ้มขายของ',
    location: 'บริเวณระหว่างอาคารเรียนรวม 5 และ ตึกวิศวกรรมเคมี',
    date: '10/15/2023',
    time: '9:00-17:00',
  },
  {
    title: 'Talk show',
    location: 'บริเวณ ใต้อาคารเรียนรวม 4 (เวทีกลาง)',
    date: '10/15/2023',
    time: '11.30-12.30',
  },
  {
    title: 'Folk song (2)',
    location: 'บริเวณ ใต้อาคารเรียนรวม 4 (เวทีกลาง)',
    date: '10/15/2023',
    time: '12.30-13.00',
  },
  {
    title: 'กิจกรรม Engineering Quest รอบชิงชนะเลิศ',
    location: 'บริเวณ ใต้อาคารเรียนรวม 4 (เวทีกลาง)',
    date: '10/15/2023',
    time: '13.30-17.00',
  },
  {
    title: 'Talk show',
    date: '10/16/2023',
    time: '10.30-11.00',
  },
  {
    title: 'Folk song (3)',
    location: 'บริเวณ ใต้อาคารเรียนรวม 4 (เวทีกลาง)',
    date: '10/16/2023',
    time: '11.30-13.00',
  },
  {
    title: 'Talk show',
    location: 'บริเวณ ใต้อาคารเรียนรวม 4 (เวทีกลาง)',
    date: '10/16/2023',
    time: '13.00-14.00',
  },
  {
    title: 'พิธีปิดงาน Open house',
    location: 'บริเวณ ตึกพระจอมเกล้าราชานุสรณ์ 190 ปี(โรงยิม)',
    date: '10/16/2023',
    time: '14.00-14.30',
  },
  {
    title: 'ซุ้มขายของ',
    location: 'บริเวณระหว่างตึก CB 5 และ ตึกวิศวกรรมเคมี',
    date: '10/16/2023',
    time: '09.00-17.00',
  },
  {
    title: 'คอนเสิร์ต',
    location: 'บริเวณ ตึกพระจอมเกล้าราชานุสรณ์ 190 ปี(โรงยิม)',
    date: '10/16/2023',
    time: '16.00-18.30',
  },
]
